관리자/CM_007/Main.yml
config:
  target: "https://komscoverse-admin.kro.kr"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 3
      arrivalRate: 100
      rampTo: 100
      name: Warm-up phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - name: "Create Admin and log in"
    flow:
      - post:
          url: "/app/main/employeeSignup"
          headers:
            sessionToken: "NDFmOTk0YTY0MGZhOTBmMDo4bXU1bzZ3UGc2c1VwdVM2TzE1REVBPT0=" #임시 세션토큰입니다 어드민 로그인 하시고 재발급 받으셔야합니다.
          json:
            _id: "20231126"
            _pw: "1234"
            _token: ""
            _name: "TestAdmin"
            _phone: "010-1234-1234"
            _class: "Developer"
          capture:
            json: "$"
            as: response
      - log: "{{response}}"
      - post:
          url: "/app/main/employeeDelete"
          headers:
            sessionToken: "NDFmOTk0YTY0MGZhOTBmMDo4bXU1bzZ3UGc2c1VwdVM2TzE1REVBPT0=" #임시 세션토큰입니다 어드민 로그인 하시고 재발급 받으셔야합니다.
          json:
            _id: "20231126"
          capture:
            json: "$"
            as: response2
      - log: "{{response2}}"